Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A system for monitoring and controlling conditions within a wine fermentation tank (42), comprising:
de_de: 1. System zur Überwachung und Steuerung von Zuständen in einem Weingärtank (42), umfassend:

source: a. at least two thermowells (48, 50) extending vertically in the fermentation tank (42); a plurality of sensor arrays (10, 52, 54) each placed within one of the at least two thermowells (48, 50) that isolates each sensor array (10, 52, 54) from fluid within the wine fermentation tank (42), each of the plurality of sensor arrays (10, 52, 54) having a length configured to allow each sensor array (10, 52, 54) to extend between an inner bottom surface (45) and an inner top surface (46) of the wine fermentation tank (42); each of the plurality of sensor arrays (10, 52, 54) having a plurality of sensors spaced along the length of the sensor array (10, 52, 54), each of the plurality of sensors configured to sense a condition to be monitored or controlled within the wine fermentation tank (42);
de_de: a. mindestens zwei Tauchhülsen (48, 50), die sich vertikal in dem Gärtank (42) erstrecken; eine Vielzahl von Sensoranordnungen (10, 52, 54), die jeweils in einer der mindestens zwei Tauchhülsen (48, 50) platziert sind, die jede Sensoranordnung (10, 52, 54) von Fluid innerhalb des Weingärtanks (42) isolieren, wobei jede der Vielzahl von Sensoranordnungen (10, 52, 54) eine Länge aufweist, die konfiguriert ist, um jeder Sensoranordnung (10, 52, 54) zu ermöglichen sich zwischen einer inneren unteren Fläche (45) und einer inneren oberen Fläche (46) des Weingärtanks (42) zu erstrecken; wobei jede der Vielzahl von Sensoranordnungen (10, 52, 54) eine Vielzahl von Sensoren aufweist, die entlang der Länge der Sensoranordnung (10, 52, 54) beabstandet sind, wobei jeder der Vielzahl von Sensoren konfiguriert ist, um einen zu überwachenden oder zu steuernden Zustand innerhalb des Weingärtanks (42) zu erfassen;

source: b. a first thermowell (48) containing a first sensor array (52) being positioned at or proximate to a center position of the wine fermentation tank (42) and a second thermowell (50) containing a second sensor array (54) being positioned at or proximate to an inner peripheral wall (47) of the wine fermentation tank (42) such that each sensor in each plurality of sensors is in lateral alignment with a corresponding sensor in another of the plurality of sensor arrays;
de_de: b. eine erste Tauchhülse (48), die eine erste Sensoranordnung (52) enthält, die an oder in der Nähe einer mittleren Position des Weingärtanks (42) positioniert ist, und eine zweite Tauchhülse (50), die eine zweite Sensoranordnung (54) enthält, die derart an oder in der Nähe einer inneren Umfangswand (47) des Weingärtanks (42) positioniert ist, dass jeder Sensor in jeder Vielzahl von Sensoren in seitlicher Ausrichtung mit einem entsprechenden Sensor in einer anderen der Vielzahl von Sensoranordnungen ist;

source: c. a computer in communication with each of the plurality of sensors which receives signals from each of the plurality of sensors corresponding to the condition sensed by each of the plurality of sensors; and
de_de: c. einen Computer, der mit jedem der Vielzahl von Sensoren kommuniziert und Signale von jedem der Vielzahl von Sensoren empfängt, die dem von jedem der Vielzahl von Sensoren erfassten Zustand entsprechen; und

source: d. a processor configured to process the signals from each of the plurality of sensors, assign known sensor data points (E1 to En, C1 to Cn) associated with each of the plurality of sensors, generate estimated sensor data points, each estimated sensor data point (E1' to En') being diametrically opposite from each known sensor data point (E1 to En, C1 to Cn) from the first sensor array (52) and the second sensor array (54) in the wine fermentation tank, and interpolate the signals across a substantial area within the wine fermentation tank (42).
de_de: d. einen Prozessor, der konfiguriert ist, um die Signale von jedem der Vielzahl von Sensoren zu verarbeiten, jedem der Vielzahl von Sensoren zugeordnete bekannte Sensordatenpunkte (E1 bis En, C1 bis Cn) zuzuordnen, geschätzte Sensordatenpunkte zu erzeugen, wobei jeder geschätzte Sensordatenpunkt (E1' bis En') jedem bekannten Sensordatenpunkt (E1 bis En, C1 bis Cn) von der ersten Sensoranordnung (52) und der zweiten Sensoranordnung (54) in dem Weingärtank diametral gegenüberliegt, und die Signale über einen wesentlichen Bereich innerhalb des Weingärtanks (42) interpoliert.

source: 2. The system according to Claim 1, wherein the plurality of sensor arrays (52, 54) comprise temperature sensor arrays;
de_de: 2. System nach Anspruch 1, wobei die Vielzahl von Sensoranordnungen (52, 54) Temperatursensoranordnungen umfasst;

source: wherein, optionally, a temperature sensor in the temperature sensor arrays is selected from the following: thermocouple, thermistor, or resistance temperature detector.
de_de: wobei optional ein Temperatursensor in den Temperatursensoranordnungen aus den folgenden Elementen ausgewählt wird: Thermoelement, Thermistor und Widerstandstemperaturdetektor.

source: 3. The system according to Claim 1, wherein the sensors within the sensor arrays (52, 54) are selected from flow, density, pressure, pH, Brix, carbon dioxide, or other chemical property or physical property.
de_de: 3. System nach Anspruch 1, wobei die Sensoren in den Sensoranordnungen (52, 54) ausgewählt sind aus Durchfluss, Dichte, Druck, pH, Brix, Kohlendioxid oder einer anderen chemischen Eigenschaft oder physikalischen Eigenschaft.

source: 4. The system according to Claim 1, further comprising a three-dimensional grid defined by the processor along latitude and longitude axes within the wine fermentation tank (42).
de_de: 4. System nach Anspruch 1, ferner umfassend ein dreidimensionales Gitter, das von dem Prozessor entlang von Breiten- und Längenachsen innerhalb des Weingärtanks (42) definiert wird.

source: 5. The system according to Claim 4, further comprising a computer configured to interpolate data received from the at least of the plurality of sensor arrays (52, 54) throughout the three-dimensional grid.
de_de: 5. System nach Anspruch 4, ferner umfassend einen Computer, der konfiguriert ist, um von mindestens einer der Vielzahl von Sensoranordnungen (52, 54) empfangene Daten über das gesamte dreidimensionale Gitter zu interpolieren.

source: 6. The system according to Claim 5, further comprising a display in communication with the computer, the display being capable of displaying interpolated data from either or both latitude or longitude axes;
de_de: 6. System nach Anspruch 5, ferner umfassend eine mit dem Computer kommunizierende Anzeige, wobei die Anzeige zum Anzeigen interpolierter Daten von einer oder beiden Breiten- oder Längenachsen in der Lage ist;

source: optionally further comprising a controller in communication with the computer and at least one of a plurality of valves and a plurality of pumps.
de_de: optional ferner eine Steuerung umfassend, die mit dem Computer und mindestens einem einer Vielzahl von Ventilen und einer Vielzahl von Pumpen kommuniziert.

source: 7. A method for monitoring conditions within a wine fermentation tank (42), comprising the steps of:
de_de: 7. Verfahren zur Überwachung von Zuständen in einem Weingärtank (42), die folgenden Schritte umfassend:

source: Positioning a first sensor array (52) proximate to a center position of the wine fermentation tank and a second sensor array (54) proximate to an inner peripheral wall of the wine fermentation tank such that each sensor of the first sensor array (52) is in lateral alignment with each sensor of the second sensor array (54);
de_de: derartiges Positionieren einer ersten Sensoranordnung (52) in der Nähe einer mittleren Position des Weingärtanks und einer zweiten Sensoranordnung (54) in der Nähe einer inneren Umfangswand des Weingärtanks, dass jeder Sensor der ersten Sensoranordnung (52) in seitlicher Ausrichtung mit jedem Sensor der zweiten Sensoranordnung (54) ist;

source: b. Sensing a condition within the wine fermentation tank (42) at a plurality of spatially separate positions within the wine fermentation tank (42) and outputting known sensor data from the first sensor array (52) and the second sensor array (54);
de_de: b. Erfassen eines Zustands innerhalb des Weingärtanks (42) an einer Vielzahl von räumlich getrennten Positionen innerhalb des Weingärtanks (42) und Ausgeben bekannter Sensordaten von der ersten Sensoranordnung (52) und der zweiten Sensoranordnung (54);

source: Generating estimated sensor data from positions diametrically opposite from each known sensor data point (E1 to En, C1 to Cn) from the second sensor array (54) in the wine fermentation tank;
de_de: Erzeugen von geschätzten Sensordaten von Positionen, die jedem bekannten Sensordatenpunkt (E1 bis En, C1 bis Cn) diametral gegenüberliegen, von der zweiten Sensoranordnung (54) in dem Weingärtank;

source: d. Conducting regression analysis on the known sensor data and the estimated sensor data (E1' to En') and interpolating data from the plurality of spatially separate positions pertaining to the condition across a substantial area of the wine fermentation tank (42); and
de_de: d. Durchführen einer Regressionsanalyse anhand der bekannten Sensordaten und der geschätzten Sensordaten (E1' bis En') und Interpolieren von Daten aus der Vielzahl von räumlich getrennten Positionen, die sich auf den Zustand über einen wesentlichen Bereich des Weingärtanks (42) beziehen; und

source: Mapping the interpolated data to represent a distribution of interpolated data across the substantial area of the wine fermentation tank (42).
de_de: Kartieren der interpolierten Daten, um eine Verteilung der interpolierten Daten über die wesentliche Fläche des Weingärtanks darzustellen (42).

source: 8. The method of Claim 8, further comprising the step of assigning a color code to data points within the distribution of interpolated data.
de_de: 8. Verfahren nach Anspruch 8, ferner umfassend den Schritt eines Zuweisens eines Farbcodes auf Datenpunkte innerhalb der Verteilung der interpolierten Daten.

source: 9. The method of Claim 8, wherein the step of sensing a condition within the wine fermentation tank (42) further comprises the step of sensing temperature at a plurality of spatially separate positions within the wine fermentation tank (42).
de_de: 9. Verfahren nach Anspruch 8, wobei der Schritt eines Erfassens eines Zustands innerhalb des Weingärtanks (42) ferner den Schritt eines Temperaturerfassens an einer Vielzahl von räumlich getrennten Positionen innerhalb des Weingärtanks (42) umfasst.

source: The method of Claim 7, further comprising the step of defining a three-dimensional grid prior to the step of interpolating data;
de_de: Verfahren nach Anspruch 7, ferner umfassend den Schritt eines Definierens eines dreidimensionalen Gitters vor dem Schritt des Interpolierens von Daten;

source: wherein, optionally, the step of interpolating data further comprises three-dimensional cubic interpolation; or
de_de: wobei der Schritt des Interpolierens von Daten optional ferner eine dreidimensionale kubische Interpolation umfasst; oder

source: wherein, optionally, the step of interpolating data further comprises the step of tri-linear interpolation.
de_de: wobei der Schritt des Interpolierens von Daten optional ferner den Schritt einer trilinearen Interpolation umfasst.

source: 1. A method, the method being computer implemented and comprising:
de_de: 1. Verfahren, wobei das Verfahren computerimplementiert ist und umfasst:

source: receiving one or more domain-specific lexicons in a specified domain, wherein each of said domain-specific lexicons comprises a plurality of tokens having each an associated sentiment orientation and sentiment score;
de_de: Empfangen eines oder mehrerer domänenspezifischer Lexika in einer spezifizierten Domäne, wobei jedes der domänenspezifischen Lexika eine Vielzahl von Token umfasst, die jeweils eine zugeordnete Stimmungsorientierung und Stimmungsbewertung aufweisen;

source: receiving one or more non-domain specific lexicons, wherein each of said non domain specific lexicons comprises a plurality of tokens having each an associated sentiment orientation and sentiment score;
de_de: Empfangen eines oder mehrerer nicht-domänenspezifischer Lexika, wobei jedes der nicht-domänenspezifischen Lexika eine Vielzahl von Token umfasst, die jeweils eine zugeordnete Stimmungsorientierung und Stimmungsbewertung aufweisen;

source: automatically identifying, in all said domain-specific and non-domain specific lexicons:
de_de: automatisches Identifizieren in allen domänenspezifischen und nicht-domänenspezifischen Lexika:

source: (i) a first subset of tokens which exist in one or more of the domain-specific lexicons and do not exist in any of the non-domain specific lexicons, wherein each of said tokens in said first subset is assigned a sentiment score equal to a linear interpolation of said associated sentiment score of said token in each of said domain-specific lexicons if the tokens exist in more than one of the domain-specific lexicons and wherein solitary tokens that exist only in one in-domain lexicon receive the sentiment score as in that in-domain lexicon, and (ii) a second subset of tokens which exist in one or more of the non-domain specific lexicons and do not exist in any of the domain-specific lexicons, wherein each token in said second subset is assigned a sentiment score equal to zero; and
de_de: (i) einer ersten Teilmenge von Token, die in einem oder mehreren der domänenspezifischen Lexika existieren und in keinem der nicht-domänenspezifischen Lexika existieren, wobei jedem der Token in der ersten Teilmenge eine Stimmungsbewertung zugeordnet wird, die gleich einer linearen Interpolation der zugeordneten Stimmungsbewertung des Tokens in jedem der domänenspezifischen Lexika ist, wenn die Token in mehr als einem der domänenspezifischen Lexika existieren, und wobei einzelne Token, die nur in einem domäneninternen Lexikon existieren, die Stimmungsbewertung wie in diesem domäneninternen Lexikon erhalten, und (ii) einer zweiten Teilmenge von Token, die in einem oder mehreren der nicht-domänenspezifischen Lexika existieren und in keinem der domänenspezifischen Lexika existieren, wobei jedem Token in der zweiten Teilmenge eine Stimmungsbewertung von Null zugeordnet wird; und

source: automatically generating a new lexicon in said specified domain comprising at least some of said first and second subsets.
de_de: automatisches Erzeugen eines neuen Lexikons in der spezifizierten Domäne, das mindestens einige der ersten und zweiten Teilmengen umfasst.

source: 2. The method of claim 1, further comprising identifying a third subset of tokens which exist in one or more of the domain-specific lexicons and one or more of the non-domain specific lexicons, wherein each of said tokens in said third subset is assigned a sentiment score equal to a linear interpolation of said associated sentiment score of said token in each of said domain-specific and non-domain specific lexicons; wherein said new lexicon further comprises at least some of said third subset.
de_de: 2. Verfahren nach Anspruch 1, ferner umfassend Identifizieren einer dritten Teilmenge von Token, die in einem oder mehreren der domänenspezifischen Lexika und einem oder mehreren der nicht-domänenspezifischen Lexika existiert, wobei jedem der Token in der dritten Teilmenge eine Stimmungsbewertung zugeordnet wird, die gleich einer linearen Interpolation der zugeordneten Stimmungsbewertung des Tokens in jedem der domänenspezifischen und nicht-domänenspezifischen Lexika ist; wobei das neue Lexikon ferner mindestens einige der dritten Teilmenge umfasst.

source: 3. The method of claim 1, further comprising:
de_de: 3. Verfahren nach Anspruch 1, ferner umfassend:

source: training a sentiment analysis classifier on a training set comprising at least said new lexicon; and
de_de: Trainieren eines Stimmungsanalyseklassifikators an einem Trainingssatz, der mindestens das neue Lexikon umfasst; und

source: applying said sentiment analysis classifier to a text corpus.
de_de: Anwenden des Klassifikators für die Stimmungsanalyse auf einen Textkorpus.

source: 4. The method of claim 1, wherein each of said associated sentiment orientations is selected from the group consisting of positive, negative, and neutral, and wherein said method further comprises automatically pruning each of said tokens having a greater probability of being associated with (i) said neutral sentiment orientation, than with (ii) said positive and said negative sentiment orientations.
de_de: 4. Verfahren nach Anspruch 1, wobei jede der zugeordneten Stimmungsorientierungen aus der Gruppe bestehend aus positiv, negativ und neutral ausgewählt wird und wobei das Verfahren ferner das automatische Entfernen jedes der Token umfasst, das eine größere Wahrscheinlichkeit aufweist, (i) der neutralen Stimmungsorientierung als (ii) der positiven und der negativen Stimmungsorientierung zugeordnet zu sein.

source: 5. The method of claim 1, wherein said interpolation comprises weighting of each of said tokens based, at least in part, on a weighted average, wherein the weights in the weighted average are assigned based on a number of occurrences of each of said tokens in each of said domain-specific and non-domain specific lexicons.
de_de: 5. Verfahren nach Anspruch 1, wobei die Interpolation eine Gewichtung jedes der Token umfasst, die zumindest teilweise auf einem gewichteten Durchschnitt basiert, wobei die Gewichte im gewichteten Durchschnitt basierend auf einer Anzahl von Vorkommen jedes der Token in jedem der domänenspezifischen und nicht-domänenspezifischen Lexika zugeordnet werden.

source: 6. The method of claim 1, wherein said interpolation comprises weighting each said token based, at least in part, on a weighted average, wherein the weights in the weighted average are assigned based on a confidence score of each of said tokens.
de_de: 6. Verfahren nach Anspruch 1, wobei die Interpolation das Gewichten jedes Tokens zumindest teilweise basierend auf einem gewichteten Durchschnitt umfasst, wobei die Gewichte in dem gewichteten Durchschnitt basierend auf einer Konfidenzbewertung jedes der Token zugeordnet werden.

source: 7. A system comprising: at least one hardware processor; and
de_de: 7. System, umfassend: mindestens einen Hardware-Prozessor; und

source: a non-transitory computer-readable storage medium having stored thereon program instructions, the program instructions executable by the at least one hardware processor to: carry out the method of any of claims 1-6.
de_de: ein nichttransitorisches computerlesbares Speichermedium, das darauf gespeicherte Programmanweisungen aufweist, wobei die Programmanweisungen durch den mindestens einen Hardwareprozessor ausführbar sind, um: das Verfahren nach einem der Ansprüche 1-6 auszuführen.

source: 8. A computer program product comprising a non-transitory computer-readable storage medium having program instructions embodied therewith, the program instructions executable by at least one hardware processor to carry out the method of any of claims 1-6.
de_de: 8. Computerprogrammprodukt, umfassend ein nichttransitorisches computerlesbares Speichermedium, das darin enthaltene Programmanweisungen aufweist, wobei die Programmanweisungen durch mindestens einen Hardwareprozessor ausführbar sind, um das Verfahren nach einem der Ansprüche 1-6 auszuführen.

source: 1. An indicator cap (100) for a pipe penetration, the indicator cap (100) comprising a cap body (30), wherein the cap body (30) comprises an engagement portion (40) for engaging the indicator cap (100) with the pipe (110), and a capping portion (50) connected to the engagement portion (40) for covering an open end (111) of the pipe (110), and
de_de: 1. Indikatorkappe (100) für eine Rohrpenetration, wobei die Indikatorkappe (100) einen Kappenkörper (30) umfasst, wobei der Kappenkörper (30) einen Eingriffsabschnitt (40) zum Eingreifen der Indikatorkappe (100) in das Rohr (110) und einen Abdeckabschnitt (50) umfasst, der mit dem Eingriffsabschnitt (40) zum Abdecken eines offenen Endes (111) des Rohrs (110) verbunden ist, und

source: wherein a surface (51) of the capping portion (50) supports a means for aiding location (10) of the indicator cap (100) and thus the pipe (110), wherein the means for aiding location (10) is adapted so as to not impede screeding thereover, and to indicate the position of the cap (100) and thus the pipe (110) post screeding, wherein the engagement portion (40) of the indicator cap (100) extends substantially perpendicularly from the capping portion (50) to an end (41), characterized in that said end (41) is connected to a flange (42).
de_de: wobei eine Oberfläche (51) des Abdeckabschnitts (50) ein Mittel für eine Lokalisierungshilfe (10) der Indikatorkappe (100) und somit des Rohrs (110) trägt, wobei das Mittel für eine Lokalisierungshilfe (10) angepasst ist, um das Abziehen darüber nicht zu behindern, und die Position der Kappe (100) und somit des Rohrs (110) nach dem Abziehen anzugeben, wobei sich der Eingriffsabschnitt (40) der Indikatorkappe (100) im Wesentlichen senkrecht von dem Abdeckabschnitt (50) zu einem Ende (41) erstreckt, dadurch gekennzeichnet, dass das Ende (41) mit einem Flansch (42) verbunden ist.

source: 2. The indicator cap (100) of claim 1, wherein the cap body (30) is substantially circular and the engagement portion (40) is also substantially circular, wherein the substantially circular engagement portion (40) comprises a pipe engaging diameter (DE), and the capping portion (50) is substantially circular, and comprises a pipe capping diameter (DC).
de_de: 2. Indikatorkappe (100) nach Anspruch 1, wobei der Kappenkörper (30) im Wesentlichen kreisförmig ist und der Eingriffsabschnitt (40) ebenfalls im Wesentlichen kreisförmig ist, wobei der im Wesentlichen kreisförmige Eingriffsabschnitt (40) einen Rohreingriffsdurchmesser (DE) umfasst, und der Kappenabschnitt (50) im Wesentlichen kreisförmig ist und einen Rohrkappendurchmesser (DC) umfasst.

source: 3. The indicator cap (100) of claim 2, wherein the pipe engaging diameter (DE) is substantially the same as the pipe capping diameter (DC), wherein the pipe engaging diameter (DE) is selected in accordance with a diameter of the pipe (110).
de_de: 3. Indikatorkappe (100) nach Anspruch 2, wobei der Rohreingriffsdurchmesser (DE) im Wesentlichen der gleiche ist wie der Rohrkappendurchmesser (DC), wobei der Rohreingriffsdurchmesser (DE) in Übereinstimmung mit einem Durchmesser des Rohres (110) gewählt ist.

source: 4. The indicator cap (100) of claim 2, wherein the pipe engaging diameter (DE) is less than the pipe capping diameter (DC), wherein the pipe engaging diameter (DE) is selected in accordance with a diameter of the pipe (110).
de_de: 4. Indikatorkappe (100) nach Anspruch 2, wobei der Rohreingriffsdurchmesser (DE) geringer ist als der Rohrkappendurchmesser (DC), wobei der Rohreingriffsdurchmesser (DE) in Übereinstimmung mit einem Durchmesser des Rohres (110) gewählt ist.

source: 5. The indicator cap (100) of claim 2, wherein the pipe engaging diameter (DE) is greater than the diameter of the pipe, and wherein in use, the capping portion (50) and the engagement portion (40) cooperatively form a cavity (31) for receiving the open end of the pipe therein.
de_de: 5. Indikatorkappe (100) nach Anspruch 2, wobei der Rohreingriffsdurchmesser (DE) größer ist als der Durchmesser des Rohres und wobei im Gebrauch der Kappenabschnitt (50) und der Eingriffsabschnitt (40) zusammenwirkend einen Hohlraum (31) zum Aufnehmen des offenen Endes des Rohres darin bilden.
